lvgl-micropython/lvgl_micropython/ext_mod/lcd_bus/esp32_src/esp_rgb_bus.c
#include "soc/soc_caps.h"

#if SOC_LCD_RGB_SUPPORTED

    #include <stdlib.h>
    #include <stdarg.h>
    #include <sys/cdefs.h>
    #include <sys/param.h>
    #include <string.h>
    #include "sdkconfig.h"
    #include "freertos/FreeRTOS.h"
    #include "freertos/task.h"
    #include "freertos/semphr.h"
    #include "esp_attr.h"
    #include "esp_check.h"
    #include "esp_pm.h"
    #include "esp_lcd_panel_interface.h"
    #include "esp_lcd_panel_ops.h"
    #include "esp_rom_gpio.h"
    #include "soc/soc_caps.h"
    #include "esp_clk_tree.h"
    #include "hal/dma_types.h"
    #include "hal/gpio_hal.h"
    #include "esp_private/gdma.h"
    #include "driver/gpio.h"
    #include "esp_bit_defs.h"
    #include "esp_private/periph_ctrl.h"
    #include "esp_psram.h"
    #include "esp_lcd_common.h"
    #include "soc/lcd_periph.h"
    #include "hal/lcd_hal.h"
    #include "hal/lcd_ll.h"
    #include "hal/gdma_ll.h"
    #include "rom/cache.h"
    #include "esp_cache.h"

    // local includes
    #include "esp_rgb_bus.h"

    static const char *TAG = "rgb_bus";

    static esp_err_t rgb_panel_io_register_callbacks(esp_lcd_panel_io_handle_t io, const esp_lcd_panel_io_callbacks_t *cbs, void *user_ctx);
    static esp_err_t rgb_panel_io_del(esp_lcd_panel_io_handle_t io);
    static esp_err_t rgb_panel_io_tx_color(esp_lcd_panel_io_t *io, int lcd_cmd, const void *color, size_t color_size);
    esp_err_t esp_lcd_new_panel_io_rgb(esp_lcd_rgb_bus_handle_t bus, const esp_lcd_panel_io_rgb_config_t *io_config, esp_lcd_panel_io_handle_t *ret_io);

    static esp_err_t rgb_bus_select_clock_src(esp_lcd_rgb_bus_t *rgb_bus, lcd_clock_source_t clk_src);
    static esp_err_t rgb_bus_create_trans_linkt_clock_src(esp_lcd_rgb_bus_t *rgb_bus);
    static esp_err_t rgb_bus_configure_gpio(esp_lcd_rgb_bus_t *rgb_bus, const esp_lcd_rgb_bus_config_t *panel_config);
    static void rgb_bus_start_transmission(esp_lcd_rgb_bus_t *rgb_bus);
    static void rgb_bus_default_isr_handler(void *args);

    #ifndef traceISR_EXIT_TO_SCHEDULER
        #define traceISR_EXIT_TO_SCHEDULER()
    #endif

    static esp_err_t rgb_bus_alloc_frame_buffers(const esp_lcd_rgb_bus_config_t *bus_config, esp_lcd_rgb_bus_handle_t rgb_bus)
    {
        bool fb_in_psram = false;
        size_t psram_trans_align = bus_config->psram_trans_align ? bus_config->psram_trans_align : 64;
        size_t sram_trans_align = bus_config->sram_trans_align ? bus_config->sram_trans_align : 4;
        rgb_bus->psram_trans_align = psram_trans_align;
        rgb_bus->sram_trans_align = sram_trans_align;

        // alloc frame buffer
        if (rgb_bus->num_fbs > 0) {
            // fb_in_psram is only an option, if there's no PSRAM on board, we fallback to alloc from SRAM
            if (bus_config->flags.fb_in_psram) {
    #if CONFIG_SPIRAM_USE_MALLOC || CONFIG_SPIRAM_USE_CAPS_ALLOC
                if (esp_psram_is_initialized()) {
                    fb_in_psram = true;
                }
    #endif
            }
            for (int i = 0; i < rgb_bus->num_fbs; i++) {
                if (fb_in_psram) {
                    // the low level malloc function will help check the validation of alignment
                    rgb_bus->fbs[i] = heap_caps_aligned_calloc(psram_trans_align, 1, rgb_bus->fb_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT | MALLOC_CAP_DMA);
                } else {
                    rgb_bus->fbs[i] = heap_caps_aligned_calloc(sram_trans_align, 1, rgb_bus->fb_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
                }
                ESP_RETURN_ON_FALSE(rgb_bus->fbs[i], ESP_ERR_NO_MEM, TAG, "no mem for frame buffer");
            }
        }

        rgb_bus->cur_fb_index = 0;
        rgb_bus->flags.fb_in_psram = fb_in_psram;

        return ESP_OK;
    }


    static esp_err_t rgb_bus_destory(esp_lcd_rgb_bus_handle_t rgb_bus)
    {
        lcd_ll_enable_clock(rgb_bus->hal.dev, false);
        if (rgb_bus->panel_id >= 0) {
            PERIPH_RCC_RELEASE_ATOMIC(lcd_periph_signals.panels[rgb_bus->panel_id].module, ref_count) {
                if (ref_count == 0) {
                    lcd_ll_enable_bus_clock(rgb_bus->panel_id, false);
                }
            }
            lcd_com_remove_device(LCD_COM_DEVICE_TYPE_RGB, rgb_bus->panel_id);
        }
        if (rgb_bus->dma_chan) {
            gdma_disconnect(rgb_bus->dma_chan);
            gdma_del_channel(rgb_bus->dma_chan);
        }
        if (rgb_bus->intr) {
            esp_intr_free(rgb_bus->intr);
        }
        if (rgb_bus->pm_lock) {
            esp_pm_lock_release(rgb_bus->pm_lock);
            esp_pm_lock_delete(rgb_bus->pm_lock);
        }
        free(rgb_bus);
        return ESP_OK;
    }


    esp_err_t esp_lcd_new_rgb_bus(const esp_lcd_rgb_bus_config_t *bus_config, esp_lcd_rgb_bus_handle_t *ret_bus)
    {
    #if CONFIG_LCD_ENABLE_DEBUG_LOG
        esp_log_level_set(TAG, ESP_LOG_DEBUG);
    #endif
        esp_err_t ret = ESP_OK;
        esp_lcd_rgb_bus_t *rgb_bus = NULL;
        ESP_GOTO_ON_FALSE(bus_config && ret_bus, ESP_ERR_INVALID_ARG, err, TAG, "invalid parameter");
        ESP_GOTO_ON_FALSE(bus_config->data_width == 16 || bus_config->data_width == 8,
                          ESP_ERR_NOT_SUPPORTED, err, TAG, "unsupported data width %d", bus_config->data_width);
        ESP_GOTO_ON_FALSE(!(bus_config->flags.double_fb && bus_config->flags.no_fb),
                          ESP_ERR_INVALID_ARG, err, TAG, "double_fb conflicts with no_fb");
        ESP_GOTO_ON_FALSE(!(bus_config->num_fbs > 0 && bus_config->num_fbs != 2 && bus_config->flags.double_fb),
                          ESP_ERR_INVALID_ARG, err, TAG, "num_fbs conflicts with double_fb");
        ESP_GOTO_ON_FALSE(!(bus_config->num_fbs > 0 && bus_config->flags.no_fb),
                          ESP_ERR_INVALID_ARG, err, TAG, "num_fbs conflicts with no_fb");

        // determine number of framebuffers
        size_t num_fbs = 1;
        if (bus_config->flags.no_fb) {
            num_fbs = 0;
        } else if (bus_config->flags.double_fb) {
            num_fbs = 2;
        } else if (bus_config->num_fbs > 0) {
            num_fbs = bus_config->num_fbs;
        }
        ESP_GOTO_ON_FALSE(num_fbs <= RGB_BUS_LCD_PANEL_MAX_FB_NUM, ESP_ERR_INVALID_ARG, err, TAG, "too many frame buffers");

