lvgl-micropython/lvgl_micropython/ext_mod/lcd_bus/esp32_src/esp_rgb_bus.c
        // bpp defaults to the number of data lines, but for serial RGB interface, they're not equal
        // e.g. for serial RGB 8-bit interface, data lines are 8, whereas the bpp is 24 (RGB888)
        size_t fb_bits_per_pixel = bus_config->data_width;
        if (bus_config->bits_per_pixel) { // override bpp if it's set
            fb_bits_per_pixel = bus_config->bits_per_pixel;
        }
        // calculate buffer size
        size_t fb_size = bus_config->h_res * bus_config->v_res * fb_bits_per_pixel / 8;

        // calculate the number of DMA descriptors
        size_t num_dma_nodes = 0;

        num_dma_nodes = (fb_size + DMA_DESCRIPTOR_BUFFER_MAX_SIZE - 1) / DMA_DESCRIPTOR_BUFFER_MAX_SIZE;

        // DMA descriptors must be placed in internal SRAM (requested by DMA)
        rgb_bus = heap_caps_calloc(1, sizeof(esp_lcd_rgb_bus_t) + num_dma_nodes * sizeof(dma_descriptor_t) * RGB_BUS_LCD_PANEL_DMA_LINKS_REPLICA,
                                     MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
        ESP_GOTO_ON_FALSE(rgb_bus, ESP_ERR_NO_MEM, err, TAG, "no mem for rgb panel");
        rgb_bus->h_res = bus_config->h_res;
        rgb_bus->v_res = bus_config->v_res;
        rgb_bus->num_dma_nodes = num_dma_nodes;
        rgb_bus->num_fbs = num_fbs;
        rgb_bus->fb_size = fb_size;
        rgb_bus->panel_id = -1;
        // register to platform
        int panel_id = lcd_com_register_device(LCD_COM_DEVICE_TYPE_RGB, rgb_bus);
        ESP_GOTO_ON_FALSE(panel_id >= 0, ESP_ERR_NOT_FOUND, err, TAG, "no free rgb panel slot");
        rgb_bus->panel_id = panel_id;

        // enable APB to access LCD registers
        PERIPH_RCC_ACQUIRE_ATOMIC(lcd_periph_signals.panels[panel_id].module, ref_count) {
            if (ref_count == 0) {
                lcd_ll_enable_bus_clock(panel_id, true);
                lcd_ll_reset_register(panel_id);
            }
        }

        // allocate frame buffers + bounce buffers
        ESP_GOTO_ON_ERROR(rgb_bus_alloc_frame_buffers(bus_config, rgb_bus), err, TAG, "alloc frame buffers failed");

        // initialize HAL layer, so we can call LL APIs later
        lcd_hal_init(&rgb_bus->hal, panel_id);
        // enable clock gating
        lcd_ll_enable_clock(rgb_bus->hal.dev, true);
        // set clock source
        ret = rgb_bus_select_clock_src(rgb_bus, bus_config->clk_src);
        ESP_GOTO_ON_ERROR(ret, err, TAG, "set source clock failed");
        // set minimal PCLK divider
        // A limitation in the hardware, if the LCD_PCLK == LCD_CLK, then the PCLK polarity can't be adjustable
        if (!(bus_config->flags.pclk_active_neg || bus_config->flags.pclk_idle_high)) {
            rgb_bus->lcd_clk_flags |= LCD_HAL_PCLK_FLAG_ALLOW_EQUAL_SYSCLK;
        }

        rgb_bus->flags.pclk_idle_high = bus_config->flags.pclk_idle_high;
        rgb_bus->flags.pclk_active_neg = bus_config->flags.pclk_active_neg;

        // install interrupt service, (LCD peripheral shares the interrupt source with Camera by different mask)
        int isr_flags = ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_SHARED | ESP_INTR_FLAG_LOWMED;
        ret = esp_intr_alloc_intrstatus(lcd_periph_signals.panels[panel_id].irq_id, isr_flags,
                                        (uint32_t)lcd_ll_get_interrupt_status_reg(rgb_bus->hal.dev),
                                        LCD_LL_EVENT_VSYNC_END, rgb_bus_default_isr_handler, rgb_bus, &rgb_bus->intr);
        ESP_GOTO_ON_ERROR(ret, err, TAG, "install interrupt failed");
        lcd_ll_enable_interrupt(rgb_bus->hal.dev, LCD_LL_EVENT_VSYNC_END, false); // disable all interrupts
        lcd_ll_clear_interrupt_status(rgb_bus->hal.dev, UINT32_MAX); // clear pending interrupt

        // install DMA service
        rgb_bus->flags.stream_mode = !bus_config->flags.refresh_on_demand;
        ret = rgb_bus_create_trans_linkt_clock_src(rgb_bus);
        ESP_GOTO_ON_ERROR(ret, err, TAG, "install DMA failed");
        // configure GPIO
        ret = rgb_bus_configure_gpio(rgb_bus, bus_config);
        ESP_GOTO_ON_ERROR(ret, err, TAG, "configure GPIO failed");
        // fill other rgb panel runtime parameters
        memcpy(rgb_bus->data_gpio_nums, bus_config->data_gpio_nums, SOC_LCD_RGB_DATA_WIDTH);
        rgb_bus->data_width = bus_config->data_width;
        rgb_bus->fb_bits_per_pixel = fb_bits_per_pixel;
        rgb_bus->output_bits_per_pixel = fb_bits_per_pixel; // by default, the output bpp is the same as the frame buffer bpp
        rgb_bus->spinlock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
        // return base class
        *ret_bus = rgb_bus;

        return ESP_OK;

    err:
        if (rgb_bus) {
            rgb_bus_destory(rgb_bus);
        }
        return ret;
    }


    esp_err_t rgb_panel_io_register_callbacks(esp_lcd_panel_io_handle_t io, const esp_lcd_panel_io_callbacks_t *cbs, void *user_ctx)
    {
        lcd_panel_io_rgb_t *rgb_device = __containerof(io, lcd_panel_io_rgb_t, base);
        esp_lcd_rgb_bus_t *rgb_bus = rgb_device->bus;

        rgb_bus->on_vsync = cbs->on_color_trans_done;
        rgb_bus->user_ctx = user_ctx;
        return ESP_OK;
    }


    esp_err_t rgb_panel_io_del(esp_lcd_panel_io_handle_t io)
    {
        return ESP_OK;
    }


    esp_err_t esp_lcd_del_rgb_bus(esp_lcd_rgb_bus_handle_t rgb_bus) {
        ESP_RETURN_ON_ERROR(rgb_bus_destory(rgb_bus), TAG, "destroy rgb io bus failed");
        return ESP_OK;
    }


    esp_err_t esp_lcd_new_panel_io_rgb(esp_lcd_rgb_bus_handle_t rgb_bus, const esp_lcd_panel_io_rgb_config_t *io_config, esp_lcd_panel_io_handle_t *ret_io)
    {
        esp_err_t ret = ESP_OK;
        // set pixel clock frequency
        rgb_bus->pclk_hz = lcd_hal_cal_pclk_freq(&rgb_bus->hal, rgb_bus->src_clk_hz, io_config->pclk_hz, rgb_bus->lcd_clk_flags);
        // pixel clock phase and polarity
        lcd_ll_set_clock_idle_level(rgb_bus->hal.dev, rgb_bus->flags.pclk_idle_high);
        lcd_ll_set_pixel_clock_edge(rgb_bus->hal.dev, rgb_bus->flags.pclk_active_neg);
        // enable RGB mode and set data width
        lcd_ll_enable_rgb_mode(rgb_bus->hal.dev, true);
        lcd_ll_set_data_width(rgb_bus->hal.dev, rgb_bus->data_width);
        lcd_ll_set_phase_cycles(rgb_bus->hal.dev, 0, 0, 1); // enable data phase only
        // number of data cycles is controlled by DMA buffer size
        lcd_ll_enable_output_always_on(rgb_bus->hal.dev, true);
        // configure HSYNC, VSYNC, DE signal idle state level
        lcd_ll_set_idle_level(rgb_bus->hal.dev, !io_config->flags.hsync_idle_low,
                              !io_config->flags.vsync_idle_low, io_config->flags.de_idle_high);
        // configure blank region timing
        lcd_ll_set_blank_cycles(rgb_bus->hal.dev, 1, 1); // RGB panel always has a front and back blank (porch region)
        lcd_ll_set_horizontal_timing(rgb_bus->hal.dev, io_config->hsync_pulse_width,
                                     io_config->hsync_back_porch, rgb_bus->h_res * rgb_bus->output_bits_per_pixel / rgb_bus->data_width,
                                     io_config->hsync_front_porch);
        lcd_ll_set_vertical_timing(rgb_bus->hal.dev, io_config->vsync_pulse_width,
                                   io_config->vsync_back_porch, rgb_bus->v_res,
                                   io_config->vsync_front_porch);
        // output hsync even in porch region
        lcd_ll_enable_output_hsync_in_porch_region(rgb_bus->hal.dev, true);
        // generate the hsync at the very beginning of line
        lcd_ll_set_hsync_position(rgb_bus->hal.dev, 0);
        // send next frame automatically in stream mode
        lcd_ll_enable_auto_next_frame(rgb_bus->hal.dev, rgb_bus->flags.stream_mode);
        // trigger interrupt on the end of frame
        lcd_ll_enable_interrupt(rgb_bus->hal.dev, LCD_LL_EVENT_VSYNC_END, true);
        // enable intr
        esp_intr_enable(rgb_bus->intr);
        // start transmission
        if (rgb_bus->flags.stream_mode) {
            rgb_bus_start_transmission(rgb_bus);
        }
        ESP_LOGD(TAG, "rgb panel(%d) start, pclk=%"PRIu32"Hz", rgb_bus->panel_id, rgb_bus->pclk_hz);

        lcd_panel_io_rgb_t *rgb_device = (lcd_panel_io_rgb_t *)heap_caps_calloc(1, sizeof(lcd_panel_io_rgb_t), MALLOC_CAP_INTERNAL);
        rgb_device->base.del = rgb_panel_io_del;
        rgb_device->base.register_event_callbacks = rgb_panel_io_register_callbacks;
        rgb_device->base.tx_color = rgb_panel_io_tx_color;

        rgb_device->bus = rgb_bus;

