lvgl-micropython/lvgl_micropython/ext_mod/lcd_bus/esp32_src/esp_rgb_bus.c
        rgb_bus->panel_io = (esp_lcd_panel_io_t *)rgb_device;
        *ret_io = &(rgb_device->base);
        return ret;
    }

    esp_err_t rgb_panel_io_tx_color(esp_lcd_panel_io_t *io, int lcd_cmd, const void *color, size_t color_size)
    {
        lcd_panel_io_rgb_t *rgb_device = __containerof(io, lcd_panel_io_rgb_t, base);
        esp_lcd_rgb_bus_t *rgb_bus = rgb_device->bus;

        if (color == rgb_bus->fbs[0]) {
            rgb_bus->cur_fb_index = 0;
        } else if (color == rgb_bus->fbs[1]) {
            rgb_bus->cur_fb_index = 1;
        } else if (color == rgb_bus->fbs[2]) {
            rgb_bus->cur_fb_index = 2;
        } else {
            return ESP_OK;
        }

        // round the boundary
        int h_res = rgb_bus->h_res;
        int v_res = rgb_bus->v_res;

        int bytes_per_pixel = rgb_bus->fb_bits_per_pixel / 8;

        uint8_t *fb = rgb_bus->fbs[rgb_bus->cur_fb_index];
        size_t bytes_to_flush = v_res * h_res * bytes_per_pixel;
        uint8_t *flush_ptr = fb;

        // Note that if we use a bounce buffer, the data gets read by the CPU as well so no need to write back
        if (rgb_bus->flags.fb_in_psram) {
            // CPU writes data to PSRAM through DCache, data in PSRAM might not get updated, so write back
            ESP_RETURN_ON_ERROR(esp_cache_msync(flush_ptr, bytes_to_flush, 0), TAG, "flush cache buffer failed");
        }

        if (rgb_bus->flags.stream_mode) {
            // the DMA will convey the new frame buffer next time
            for (int i = 0; i < RGB_BUS_LCD_PANEL_DMA_LINKS_REPLICA; i++) {
                rgb_bus->dma_nodes[rgb_bus->num_dma_nodes * (i + 1) - 1].next = rgb_bus->dma_links[rgb_bus->cur_fb_index];
            }
        }

        return ESP_OK;
    }

    static esp_err_t rgb_bus_configure_gpio(esp_lcd_rgb_bus_t *rgb_bus, const esp_lcd_rgb_bus_config_t *bus_config)
    {
        int panel_id = rgb_bus->panel_id;
        // check validation of GPIO number
        bool valid_gpio = true;
        if (bus_config->de_gpio_num < 0) {
            // Hsync and Vsync are required in HV mode
            valid_gpio = valid_gpio && (bus_config->hsync_gpio_num >= 0) && (bus_config->vsync_gpio_num >= 0);
        }
        for (size_t i = 0; i < bus_config->data_width; i++) {
            valid_gpio = valid_gpio && (bus_config->data_gpio_nums[i] >= 0);
        }
        if (!valid_gpio) {
            return ESP_ERR_INVALID_ARG;
        }
        // connect peripheral signals via GPIO matrix
        for (size_t i = 0; i < bus_config->data_width; i++) {
            gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[bus_config->data_gpio_nums[i]], PIN_FUNC_GPIO);
            gpio_set_direction(bus_config->data_gpio_nums[i], GPIO_MODE_OUTPUT);
            esp_rom_gpio_connect_out_signal(bus_config->data_gpio_nums[i],
                                            lcd_periph_signals.panels[panel_id].data_sigs[i], false, false);
        }
        if (bus_config->hsync_gpio_num >= 0) {
            gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[bus_config->hsync_gpio_num], PIN_FUNC_GPIO);
            gpio_set_direction(bus_config->hsync_gpio_num, GPIO_MODE_OUTPUT);
            esp_rom_gpio_connect_out_signal(bus_config->hsync_gpio_num,
                                            lcd_periph_signals.panels[panel_id].hsync_sig, false, false);
        }
        if (bus_config->vsync_gpio_num >= 0) {
            gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[bus_config->vsync_gpio_num], PIN_FUNC_GPIO);
            gpio_set_direction(bus_config->vsync_gpio_num, GPIO_MODE_OUTPUT);
            esp_rom_gpio_connect_out_signal(bus_config->vsync_gpio_num,
                                            lcd_periph_signals.panels[panel_id].vsync_sig, false, false);
        }
        // PCLK may not be necessary in some cases (i.e. VGA output)
        if (bus_config->pclk_gpio_num >= 0) {
            gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[bus_config->pclk_gpio_num], PIN_FUNC_GPIO);
            gpio_set_direction(bus_config->pclk_gpio_num, GPIO_MODE_OUTPUT);
            esp_rom_gpio_connect_out_signal(bus_config->pclk_gpio_num,
                                            lcd_periph_signals.panels[panel_id].pclk_sig, false, false);
        }
        // DE signal might not be necessary for some RGB LCD
        if (bus_config->de_gpio_num >= 0) {
            gpio_hal_iomux_func_sel(GPIO_PIN_MUX_REG[bus_config->de_gpio_num], PIN_FUNC_GPIO);
            gpio_set_direction(bus_config->de_gpio_num, GPIO_MODE_OUTPUT);
            esp_rom_gpio_connect_out_signal(bus_config->de_gpio_num,
                                            lcd_periph_signals.panels[panel_id].de_sig, false, false);
        }
        return ESP_OK;
    }

    esp_err_t rgb_bus_select_clock_src(esp_lcd_rgb_bus_t *rgb_bus, lcd_clock_source_t clk_src)
    {
        // get clock source frequency
        uint32_t src_clk_hz = 0;
        ESP_RETURN_ON_ERROR(esp_clk_tree_src_get_freq_hz((soc_module_clk_t)clk_src, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED, &src_clk_hz),
                            TAG, "get clock source frequency failed");
        rgb_bus->src_clk_hz = src_clk_hz;
        lcd_ll_select_clk_src(rgb_bus->hal.dev, clk_src);

        // create pm lock based on different clock source
        // clock sources like PLL and XTAL will be turned off in light sleep
    #if CONFIG_PM_ENABLE
        ESP_RETURN_ON_ERROR(esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0, "rgb_panel", &rgb_bus->pm_lock), TAG, "create pm lock failed");
        // hold the lock during the whole lifecycle of RGB panel
        esp_pm_lock_acquire(rgb_bus->pm_lock);
        ESP_LOGD(TAG, "installed pm lock and hold the lock during the whole panel lifecycle");
    #endif

        return ESP_OK;
    }


    // If we restart GDMA, many pixels already have been transferred to the LCD peripheral.
    // Looks like that has 16 pixels of FIFO plus one holding register.
    #define RGB_FIFO_PRESERVE_SIZE_PX (GDMA_LL_L2FIFO_BASE_SIZE + 1)


    static esp_err_t rgb_bus_create_trans_linkt_clock_src(esp_lcd_rgb_bus_t *rgb_bus)
    {
        for (int i = 0; i < RGB_BUS_LCD_PANEL_DMA_LINKS_REPLICA; i++) {
            rgb_bus->dma_links[i] = &rgb_bus->dma_nodes[rgb_bus->num_dma_nodes * i];
        }
        // chain DMA descriptors
        for (int i = 0; i < rgb_bus->num_dma_nodes * RGB_BUS_LCD_PANEL_DMA_LINKS_REPLICA; i++) {
            rgb_bus->dma_nodes[i].dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_CPU;
            rgb_bus->dma_nodes[i].next = &rgb_bus->dma_nodes[i + 1];
        }


        if (rgb_bus->flags.stream_mode) {
            // circle DMA descriptors chain for each frame buffer
            for (int i = 0; i < RGB_BUS_LCD_PANEL_DMA_LINKS_REPLICA; i++) {
                rgb_bus->dma_nodes[rgb_bus->num_dma_nodes * (i + 1) - 1].next = &rgb_bus->dma_nodes[rgb_bus->num_dma_nodes * i];
            }
        } else {
            // one-off DMA descriptors chain
            for (int i = 0; i < RGB_BUS_LCD_PANEL_DMA_LINKS_REPLICA; i++) {
                rgb_bus->dma_nodes[rgb_bus->num_dma_nodes * (i + 1) - 1].next = NULL;
            }
        }
        // mount the frame buffer to the DMA descriptors
        for (size_t i = 0; i < rgb_bus->num_fbs; i++) {
            lcd_com_mount_dma_data(rgb_bus->dma_links[i], rgb_bus->fbs[i], rgb_bus->fb_size);
        }

        // On restart, the data sent to the LCD peripheral needs to start LCD_FIFO_PRESERVE_SIZE_PX pixels after the FB start
        // so we use a dedicated DMA node to restart the DMA transaction
        memcpy(&rgb_bus->dma_restart_node, &rgb_bus->dma_nodes[0], sizeof(rgb_bus->dma_restart_node));
        int restart_skip_bytes = RGB_FIFO_PRESERVE_SIZE_PX * sizeof(uint16_t);
        uint8_t *p = (uint8_t *)rgb_bus->dma_restart_node.buffer;
        rgb_bus->dma_restart_node.buffer = &p[restart_skip_bytes];
        rgb_bus->dma_restart_node.dw0.length -= restart_skip_bytes;
        rgb_bus->dma_restart_node.dw0.size -= restart_skip_bytes;

        // alloc DMA channel and connect to LCD peripheral
        gdma_channel_alloc_config_t dma_chan_config = {
            .direction = GDMA_CHANNEL_DIRECTION_TX,
        };
    #if SOC_GDMA_TRIG_PERIPH_LCD0_BUS == SOC_GDMA_BUS_AHB
        ESP_RETURN_ON_ERROR(gdma_new_ahb_channel(&dma_chan_config, &rgb_bus->dma_chan), TAG, "alloc DMA channel failed");
    #elif SOC_GDMA_TRIG_PERIPH_LCD0_BUS == SOC_GDMA_BUS_AXI
        ESP_RETURN_ON_ERROR(gdma_new_axi_channel(&dma_chan_config, &rgb_bus->dma_chan), TAG, "alloc DMA channel failed");
    #endif
        gdma_connect(rgb_bus->dma_chan, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_LCD, 0));
        gdma_transfer_ability_t ability = {
            .psram_trans_align = rgb_bus->psram_trans_align,
            .sram_trans_align = rgb_bus->sram_trans_align,
        };
        gdma_set_transfer_ability(rgb_bus->dma_chan, &ability);

        return ESP_OK;
    }

    // reset the GDMA channel every VBlank to stop permanent desyncs from happening.
    // Note that this fix can lead to single-frame desyncs itself, as in: if this interrupt
    // is late enough, the display will shift as the LCD controller already read out the
    // first data bytes, and resetting DMA will re-send those. However, the single-frame
    // desync this leads to is preferable to the permanent desync that could otherwise
    // happen. It's also not super-likely as this interrupt has the entirety of the VBlank
    // time to reset DMA.

    static void rgb_bus_start_transmission(esp_lcd_rgb_bus_t *rgb_bus)
    {
        // reset FIFO of DMA and LCD, incase there remains old frame data
        gdma_reset(rgb_bus->dma_chan);
        lcd_ll_stop(rgb_bus->hal.dev);
        lcd_ll_fifo_reset(rgb_bus->hal.dev);

        // the start of DMA should be prior to the start of LCD engine
        gdma_start(rgb_bus->dma_chan, (intptr_t)rgb_bus->dma_links[rgb_bus->cur_fb_index]);
        // delay 1us is sufficient for DMA to pass data to LCD FIFO
        // in fact, this is only needed when LCD pixel clock is set too high
        esp_rom_delay_us(1);
        // start LCD engine
        lcd_ll_start(rgb_bus->hal.dev);
    }


    IRAM_ATTR static void lcd_rgb_panel_try_update_pclk(esp_lcd_rgb_bus_t *rgb_bus)
    {
        portENTER_CRITICAL_ISR(&rgb_bus->spinlock);
        if (unlikely(rgb_bus->flags.need_update_pclk)) {
            rgb_bus->flags.need_update_pclk = false;
            rgb_bus->pclk_hz = lcd_hal_cal_pclk_freq(&rgb_bus->hal, rgb_bus->src_clk_hz, rgb_bus->pclk_hz, rgb_bus->lcd_clk_flags);
        }
        portEXIT_CRITICAL_ISR(&rgb_bus->spinlock);
    }


    IRAM_ATTR static void rgb_bus_default_isr_handler(void *args)
    {
        esp_lcd_rgb_bus_t *rgb_bus = (esp_lcd_rgb_bus_t *)args;
        bool need_yield = false;

        uint32_t intr_status = lcd_ll_get_interrupt_status(rgb_bus->hal.dev);
        lcd_ll_clear_interrupt_status(rgb_bus->hal.dev, intr_status);
        if (intr_status & LCD_LL_EVENT_VSYNC_END) {
            // call user registered callback
            if (rgb_bus->on_vsync) {
                if (rgb_bus->fbs[rgb_bus->cur_fb_index] != rgb_bus->cur_buf) {
                    rgb_bus->cur_buf = rgb_bus->fbs[rgb_bus->cur_fb_index];
                    rgb_bus->swapped_framebuf = true;
                }
                if (rgb_bus->on_vsync(rgb_bus->panel_io, NULL, rgb_bus->user_ctx)) {
                    need_yield = true;
                }
            }

            // check whether to update the PCLK frequency, it should be safe to update the PCLK frequency in the VSYNC interrupt
            lcd_rgb_panel_try_update_pclk(rgb_bus);

        }
        if (need_yield) {
            portYIELD_FROM_ISR();
        }
    }
#endif

